<template>
  <div class="dashboard-container">
    <!--<div class="dashboard-text">name:{{name}}</div>-->
    <!--<div class="dashboard-text">roles:<span v-for='role in roles' :key='role'>{{role}}</span></div>-->
    <img class="dashboard-image" :src="home"/>
    <el-dialog :visible.sync="responsibilityDialogVisible" >
      <el-tag type="info" style="width:100%;height:100%">
        <h1 style="text-align:center">免责声明</h1>
        <p style="white-space:normal">
          1、一切网民进入“C2C短租”主页及各层页面，被视为已经仔细看过本条款及网站其他相关声明和用户协议，并完全同意。凡以任何方式登陆本网站，或者直接、间接使用本网站资料与服务者，均被视为自愿接受本网站相关声明和用户服务协议的约束。<br/>
<br/>
          2、“C2C短租”仅负责提供平台技术服务。“C2C短租”上关于“C2C短租”注册用户的注册数据、其发布的信息（包括但不限于用户名称，联络信息，联系人，房间信息描述、说明及相关图片等）、交易行为以及与交易有关的其它事项均由注册用户自行提供并依法对其提供的任何信息承担全部责任。<br/>
<br/>
          3、出现以下情况或法律法规有明确要求，“C2C短租”将进行审查或处理，包括下线、删除或诉诸法律：<br/>
<br/>
          （1）“C2C短租”有合理的理由认为特定会员及具体交易事项可能存在重大违法或违约情形。<br/>
<br/>
          （2）“C2C短租”有合理理由认为会员在C2C短租的行为涉嫌违法或不当。<br/>
<br/>
          4、“C2C短租”仅作为您获取信息、选择交易对象、就服务的交易进行协商及开展交易的场所，无法控制交易的房屋质量、安全或合法性，商贸信息的真实性或准确性，以及交易各方履行其在交易协议中的各项义务的能力。您应自行谨慎判断确定相关信息的真实性、合法性和有效性，并自行承担因此产生的责任和损失。<br/>
<br/>
          5、“C2C短租”对任何自本网站而获得的他人的信息、内容或者广告宣传等任何咨询，不保证其真实、准确和完整性。如果任何单位或者个人通过上述信息而进行任何行为，您需自行甄别真伪和谨慎预防风险。否则，无论何种原因，“C2C短租”不对任何非与本网站直接发生交易或脱离本站发生的交易和/或行为承担直接、间接、附带或衍生的损失和责任。<br/>
<br/>
          6、“C2C短租”有权受理您与其他“C2C短租”用户通过“C2C短租”交易产生的争议，并有权单方判断与该争议相关的事实及应适用的规则，进而作出处理决定。该处理决定对您有约束力，并且当您注册使用“C2C短租”服务时，就已经同意遵守“C2C短租”的相关规则。您理解并同意“C2C短租”并非司法机构，仅能以普通人身份对证据进行鉴别，“C2C短租”对争议的调处完全是基于您的委托，“C2C短租”及其相关联公司无法保证争议处理结算符合您的期望，也不对争议调处结论承担任何责任，如您因此遭受损失，您同意自行向受益人索偿。<br/>
<br/>
          7、“C2C短租”不担保或保证“C2C短租”服务一定满足用户的要求，对其不作任何明示或者暗示的保证。对“C2C短租”服务的及时性、安全性、准确性、适用性、持续性、可靠性、适用于某一特定用途也都不作任何担保或保证，用户须独立承担前述风险。<br/>
<br/>
          8、“C2C短租”对“C2C短租”服务所设计的技术及信息的有效性、准确性、正确性、质量、稳定、完整和及时性不作出任何承诺和保证。<br/>
<br/>
          9、“C2C短租”不担保用户在使用服务过程中网络服务不会中断。对于用户使用“C2C短租”服务或无法使用“C2C短租”服务所导致的计算机软、硬件的损害或发生资料的流失等任何直接、间接、附带、特别、衍生的损害不承担任何责任。<br/>
<br/>
          10、除“C2C短租”注明之服务条款外，其它原因不当使用本网而导致的任何意外、疏忽、合约毁坏、诽谤、版权或其他知识产权侵犯及其所造成的任何损失（包括因不当下载而感染电脑病毒等），“C2C短租”概不负责，亦不承担任何法律责任。<br/>
<br/>
          11、不论任何情况下，“C2C短租”均不对由于互联网正常设备维护，互联网络链接故障，电脑、通讯或其他系统的故障，电力故障，罢工，劳动争议，暴乱，起义，骚乱，生产力或生产材料不足，火灾，洪水，风暴，爆炸战争，政府行为，司法行政机关的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。<br/>
<br/>
          12、您了解并同意，“C2C短租”对因下述任一情况而导致您的任何损害赔偿承担责任，包括但不限于利润、商誉、使用、数据等方面的损失或其它无形损失的损害赔偿（无论“C2C短租”是否已被告知该等损害赔偿的可能性）：<br/>
<br/>
          （1）使用或未能使用“C2C短租”服务；<br/>
<br/>
          （2）第三方未经批准使用您的账户或更改您的数据；<br/>
<br/>
          （3）通过“C2C短租”服务购买或获取任何商品、数据、信息等行为产生的费用及损失；<br/>
<br/>
          （4）您对“C2C短租”服务的误解。<br/>
<br/>
          （5）任何非因“C2C短租”的原因而引起的与“C2C短租”服务有关的其它损失。<br/>
<br/>
          13、用户明确同意使用“C2C短租”服务所存在的风险将完全由其本人承担；因其使用“C2C短租”服务而产生的一切后果也由其本人承担。“C2C短租”对用户及任何第三方不承担任何责任。<br/>
<br/>
          14、本声明未涉及的问题请参见国家有关法律法规，当本声明与国家有关法律法规冲突时，以国家法律法规为准。<br/>
<br/>
          15、本网站相关声明版权及其修改权、更新权和最终解释权均属“C2C短租”所有。<br/>
        </p>
      </el-tag>
      <el-button @click="responsibilityDialogVisible=false" type="primary" style="margin-left:800px;margin-top:20px;">同意</el-button>
    </el-dialog>
  </div>
</template>

<script>
import { mapGetters } from 'vuex'
import home from '@/assets/home_images/home.png'

export default {
  name: 'dashboard',
  data() {
    return {
      home,
      responsibilityDialogVisible:true,
    }
  },
  computed: {
    ...mapGetters([
      'name',
      'roles'
    ])
  }
}
</script>

<style rel="stylesheet/scss" lang="scss" scoped>
.dashboard {
  &-container {
    margin: 30px;
    margin-left: 250px;
  }
  &-text {
    font-size: 30px;
    line-height: 46px;
    
  }
  &-image{
    height: 830px;
  }
}
</style>
